In [161]:
#from a dictionary #values in the list format
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [162]:
import pandas as pd

In [163]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'], columns=['country', 'capital'])
brics

        country    capital
A        Brazil   Brasilia
B        Russia     Moscow
C         India  New Delhi
D         China    Beijing
E  South Africa   Pretoria

In [164]:
brics = pd.DataFrame(dict1)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [165]:
dict2 = {'country': 'South Africa', 'Capital': "Pretoria", "area": 1.221, 'population': 52.98}

In [166]:
x = pd.Series(dict2)
x

country       South Africa
Capital           Pretoria
area                 1.221
population           52.98
dtype: object

In [167]:
dict3  = {0:'Brazil', 1: 'Russia', 2: "India"}
ser = pd.Series(dict3)

In [168]:
#create df from this series
pd.DataFrame(ser, columns=['country'])

  country
0  Brazil
1  Russia
2   India

In [169]:
#create a df from a list of dictionaries
lst = [{"name": "Raj", "Age": 21}, {"name": "Mukul", "Age": 25}, {"name": "Rahul", "Age": 34}]

In [170]:
pd.DataFrame(lst)

   Age   name
0   21    Raj
1   25  Mukul
2   34  Rahul

In [171]:
#create a df from the list of row values
lst_1 = ["Brazil", "Brasilia", 8.516, 200.40]
lst_2= ["SA", "Pretoria", 1.221, 52.98]

In [172]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [173]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [174]:
pd.DataFrame(data = [lst_1, lst_2], columns= ['area', 'capital', 'country', 'population'])

     area   capital  country  population
0  Brazil  Brasilia    8.516      200.40
1      SA  Pretoria    1.221       52.98

In [175]:
#how to work with column names and row indices

In [176]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [177]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [178]:
brics.columns = ['co', 'cap', 'ar', 'pop']

In [179]:
brics

             co        cap      ar      pop
0        Brazil   Brasilia   8.516   200.40
1        Russia     Moscow  17.100   143.50
2         India  New Delhi   3.286  1252.00
3         China    Beijing   9.597  1357.00
4  South Africa   Pretoria   1.221    52.98

In [180]:
x = list(brics.columns)

In [181]:
x[2] = "area"

In [182]:
x[0]= "country"

In [183]:
x

['country', 'cap', 'area', 'pop']

In [184]:
x[1]="capital"

In [185]:
brics.columns = x

In [186]:
brics.columns

Index(['country', 'capital', 'area', 'pop'], dtype='object')

In [187]:
a = brics.rename(columns={'pop': 'population'})

In [188]:
brics

        country    capital    area      pop
0        Brazil   Brasilia   8.516   200.40
1        Russia     Moscow  17.100   143.50
2         India  New Delhi   3.286  1252.00
3         China    Beijing   9.597  1357.00
4  South Africa   Pretoria   1.221    52.98

In [189]:
a

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [190]:
brics.rename(columns = {'pop': 'population'}, inplace = True)

In [191]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [192]:
brics.rename(mapper = str.upper, axis = "columns", inplace=True )

In [193]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [194]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [195]:
brics.set_index('COUNTRY', inplace = True)

In [196]:
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [197]:
brics.rename(index = {"South Africa": "SA"}, inplace = True)

In [198]:
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [199]:
brics.reset_index(inplace = True)

---

In [200]:
movies = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv", index_col = 0, na_values = [1, "?", "NA", None] )

In [201]:
movies.head(2)

                    title                                       genres
movieId
NaN      Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
 2.0       Jumanji (1995)                   Adventure|Children|Fantasy

In [202]:
movies = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv", index_col = 0, na_values = {'genres': ['?', "NA", "1"]})

In [203]:
movies.head(3)

                           title                                       genres
movieId
1               Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
2                 Jumanji (1995)                   Adventure|Children|Fantasy
3        Grumpier Old Men (1995)                               Comedy|Romance

In [204]:
x = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name=['Sheet1','ABC'])

In [205]:
x['Sheet1']

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE
3,2010-04-01,G0470117,QUA MINERAL WATER(1000ML),13:19:55,1,50.0,11.88,0.0,61.88,BEVERAGE
4,2010-04-01,G0470283,MOROCCAN MINT TEA,01:20:18,1,45.0,10.69,0.0,55.69,BEVERAGE
5,2010-04-01,G0470283,QUA MINERAL WATER(1000ML),01:20:18,1,50.0,11.88,0.0,61.88,BEVERAGE
6,2010-04-01,G0470118,MASALA CHAI CUTTING,13:21:34,1,40.0,9.50,0.0,49.50,BEVERAGE
7,2010-04-01,G0470118,MOROCCAN MINT TEA,13:21:34,1,45.0,10.69,0.0,55.69,BEVERAGE
8,2010-04-01,G0470284,CAPPUCCINO,01:29:38,1,60.0,14.25,0.0,74.25,BEVERAGE
9,2010-04-01,G0470285,MOROCCAN MINT TEA,01:29:46,1,45.0,10.69,0.0,55.69,BEVERAGE
10,2010-04-01,G0470285,SUMATRA MANDHELING (REG),01:29:46,1,95.0,22.56,0.0,117.56,BEVERAGE
11,2010-04-01,G0470285,BRAZIL BOURBONSANTOS (AULAIT),01:29:46,1,115.0,27.31,0.0,142.31,BEVERAGE
12,2010-04-01,G0470120,LEMON ICED TEA,13:36:33,1,85.0,20.19,0.0,105.19,BEVERAGE
13,2010-04-01,G0470122,COUNTRY LEMONADE,13:42:05,1,85.0,20.19,0.0,105.19,BEVERAGE
14,2010-04-01,G0470122,LEMON ICED TEA,13:42:05,2,85.0,40.38,0.0,210.38,BEVERAGE
15,2010-04-01,G0470127,CAPPUCCINO,14:02:15,1,60.0,14.25,0.0,74.25,BEVERAGE
16,2010-04-01,G0470128,QUA MINERAL WATER(1000ML),14:02:35,1,50.0,11.88,0.0,61.88,BEVERAGE
17,2010-04-01,G0470133,CAPPUCCINO,14:21:32,2,60.0,28.50,0.0,148.50,BEVERAGE
18,2010-04-01,G0470139,QUA MINERAL WATER(1000ML),14:53:24,1,50.0,11.88,0.0,61.88,BEVERAGE
19,2010-04-01,G0470140,MIAMI MELONS,14:54:32,1,85.0,20.19,0.0,105.19,BEVERAGE
20,2010-04-01,G0470141,CAFFE LATTE,15:08:58,1,70.0,16.63,0.0,86.63,BEVERAGE
21,2010-04-01,G0470141,CAPPUCCINO,15:08:58,2,60.0,28.50,0.0,148.50,BEVERAGE
22,2010-04-01,G0470142,COUNTRY LEMONADE,15:09:07,1,85.0,20.19,0.0,105.19,BEVERAGE
23,2010-04-01,G0470145,COUNTRY LEMONADE,15:39:18,1,85.0,20.19,0.0,105.19,BEVERAGE
24,2010-04-01,G0470146,RED BULL ENERGY DRINK,15:48:25,1,125.0,29.69,0.0,154.69,BEVERAGE
25,2010-04-01,G0470148,BRAZIL BOURBONSANTOS (REG),16:06:01,1,95.0,22.56,0.0,117.56,BEVERAGE
26,2010-04-01,G0470149,DOPPIO,16:07:55,1,60.0,14.25,0.0,74.25,BEVERAGE
27,2010-04-01,G0470153,CAFFE LATTE,16:15:45,1,70.0,16.63,0.0,86.63,BEVERAGE
28,2010-04-01,G0470154,PINK LEMONADE,16:15:50,1,85.0,20.19,0.0,105.19,BEVERAGE
29,2010-04-01,G0470156,CAPPUCCINO,16:16:40,1,60.0,14.25,0.0,74.25,BEVERAGE
...,...,...,...,...,...,...,...,...,...,...
145800,2011-02-25,N0033492,WHITE SANGRIA (GLS)áááá áááááá,00:57:01,1,175.0,45.50,0.0,220.50,LIQUOR
145801,2010-04-25,N0028289,WHITE SANGRIA (GLS)áááá áááááá,13:53:17,1,175.0,45.50,0.0,220.50,LIQUOR
145802,2010-05-26,N0028780,WHITE SANGRIA (GLS)áááá áááááá,21:58:31,1,175.0,45.50,0.0,220.50,LIQUOR
145803,2010-11-26,N0031644,WHITE SANGRIA (GLS)áááá áááááá,16:06:25,1,175.0,45.50,0.0,220.50,LIQUOR
145804,2010-12-28,N0032407,WHITE SANGRIA (GLS)áááá áááááá,21:50:35,1,175.0,45.50,0.0,220.50,LIQUOR
145805,2011-01-29,N0033015,WHITE SANGRIA (GLS)áááá áááááá,00:05:32,1,175.0,45.50,0.0,220.50,LIQUOR
145806,2010-05-29,N0028849,WHITE SANGRIA (GLS)áááá áááááá,23:11:29,1,175.0,45.50,0.0,220.50,LIQUOR
145807,2010-09-29,N0030759,WHITE SANGRIA (GLS)áááá áááááá,22:43:23,2,175.0,91.00,0.0,441.00,LIQUOR
145808,2010-11-30,N0031733,WHITE SANGRIA (GLS)áááá áááááá,21:34:54,2,175.0,91.00,0.0,441.00,LIQUOR
145809,2010-12-30,N0032455,WHITE SANGRIA (GLS)áááá áááááá,22:10:50,1,175.0,45.50,0.0,220.50,LIQUOR
145810,2010-07-31,N0029786,WHITE SANGRIA (GLS)áááá áááááá,18:38:26,1,175.0,45.50,0.0,220.50,LIQUOR
145811,2010-06-06,N0028955,ZINZI RED (GLS),20:55:01,1,150.0,39.00,0.0,189.00,LIQUOR
145812,2010-05-16,N0028643,ZINZI RED (GLS),23:12:37,1,150.0,39.00,0.0,189.00,LIQUOR
145813,2010-05-23,N0028741,ZINZI RED (GLS),22:44:29,1,150.0,39.00,0.0,189.00,LIQUOR
145814,2010-05-23,N0028742,ZINZI RED (GLS),22:59:31,1,150.0,39.00,0.0,189.00,LIQUOR
145815,2010-05-24,N0028754,ZINZI RED (GLS),01:08:06,1,150.0,39.00,0.0,189.00,LIQUOR
145816,2010-04-27,N0028347,ZINZI RED (GLS),00:19:00,1,150.0,39.00,0.0,189.00,LIQUOR
145817,2010-05-29,N0028860,ZINZI RED (GLS),01:20:13,1,150.0,39.00,0.0,189.00,LIQUOR
145818,2010-05-29,N0028850,ZINZI RED (GLS),23:12:22,1,150.0,39.00,0.0,189.00,LIQUOR
145819,2010-04-30,N0028399,ZINZI RED (GLS),23:44:37,1,150.0,39.00,0.0,189.00,LIQUOR
145820,2010-06-08,N0028991,ZINZI WHITE (GLS),01:09:11,2,150.0,78.00,0.0,378.00,LIQUOR
145821,2010-06-08,N0028977,ZINZI WHITE (GLS),10:41:38,1,150.0,39.00,0.0,189.00,LIQUOR
145822,2010-06-10,N0029010,ZINZI WHITE (GLS),01:00:53,2,150.0,78.00,0.0,378.00,LIQUOR
145823,2010-05-18,N0028656,ZINZI WHITE (GLS),16:52:21,1,150.0,39.00,0.0,189.00,LIQUOR
145824,2010-05-19,N0028669,ZINZI WHITE (GLS),17:06:10,1,150.0,39.00,0.0,189.00,LIQUOR
145825,2010-05-22,N0028716,ZINZI WHITE (GLS),21:43:55,2,150.0,78.00,0.0,378.00,LIQUOR
145826,2010-04-27,N0028343,ZINZI WHITE (GLS),20:52:11,2,150.0,78.00,0.0,378.00,LIQUOR
145827,2010-05-28,N0028835,ZINZI WHITE (GLS),01:03:37,3,150.0,117.00,0.0,567.00,LIQUOR
145828,2010-04-30,N0028399,ZINZI WHITE (GLS),23:44:37,1,150.0,39.00,0.0,189.00,LIQUOR
145829,2010-07-09,N0029472,ZINZI WHITE (BTL),00:31:51,1,700.0,182.00,0.0,882.00,LIQUOR

In [206]:
x['ABC']

   Unnamed: 0 Unnamed: 1
0         NaN        NaN
1         NaN          s
2         3.0          4

In [207]:
import warnings
warnings.filterwarnings(action = 'ignore')

In [208]:
movies = pd.read_table(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.dat", sep = "::", names = ["MovieID", "Title", "Genres"] )

In [209]:
movies.head(3)

   MovieID                    Title                        Genres
0        1         Toy Story (1995)   Animation|Children's|Comedy
1        2           Jumanji (1995)  Adventure|Children's|Fantasy
2        3  Grumpier Old Men (1995)                Comedy|Romance

In [210]:
from sklearn import datasets
import numpy as np

In [211]:
bs = datasets.load_boston()

In [212]:
bs

{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
         4.9800e+00],
        [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
         9.1400e+00],
        [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
         4.0300e+00],
        ...,
        [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         5.6400e+00],
        [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
         6.4800e+00],
        [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         7.8800e+00]]),
 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
        18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
        15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
        13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
        21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
        35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
        19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
        20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
        23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
        33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
        21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
        20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
        23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
        15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
        17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
        25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
        23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
        32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
        34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
        20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
        26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
        31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
        22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
        42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
        36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
        32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
        20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
        20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
        22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
        21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
        19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
        32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
        18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
        16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
        13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
         7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
        12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
        27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
         8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
         9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
        10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
        15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
        19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
        29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
        20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
        23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]),
 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
        'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'),
 'DESCR': "Boston House Prices dataset\n===========================\n\nNotes\n------\nData Set Characteristics:  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive\n    \n    :Median Value (attribute 14) is usually the target\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttp://archive.ics.uci.edu/ml/datasets/Housing\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n**References**\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n   - many more! (see http://archive.ics.uci.edu/ml/datasets/Housing)\n"}

In [213]:
X = bs.data #values for all the IVs
X[0]

array([6.320e-03, 1.800e+01, 2.310e+00, 0.000e+00, 5.380e-01, 6.575e+00,
       6.520e+01, 4.090e+00, 1.000e+00, 2.960e+02, 1.530e+01, 3.969e+02,
       4.980e+00])

In [214]:
X.shape

(506, 13)

In [215]:
y = bs.target # y values
y[:20]

array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
       18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2])

In [216]:
y.shape

(506,)

In [217]:
bs.feature_names

array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7')

In [218]:
import numpy as np

In [219]:
p = np.c_[y, X]

In [220]:
p.shape

(506, 14)

In [221]:
p[0]

array([2.400e+01, 6.320e-03, 1.800e+01, 2.310e+00, 0.000e+00, 5.380e-01,
       6.575e+00, 6.520e+01, 4.090e+00, 1.000e+00, 2.960e+02, 1.530e+01,
       3.969e+02, 4.980e+00])

In [222]:
bs.feature_names

array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7')

In [223]:
col= ['medv'] + list(bs.feature_names)

In [224]:
col

['medv',
 'CRIM',
 'ZN',
 'INDUS',
 'CHAS',
 'NOX',
 'RM',
 'AGE',
 'DIS',
 'RAD',
 'TAX',
 'PTRATIO',
 'B',
 'LSTAT']

In [225]:
bosdf = pd.DataFrame(p, columns= col)

In [226]:
bosdf.head(3)

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

---

In [227]:
iris = datasets.load_iris()

In [228]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [229]:
X = iris.data

In [230]:
y = iris.target

In [231]:
X.shape, y.shape

((150, 4), (150,))

In [232]:
print(X[0])

[5.1 3.5 1.4 0.2]

In [233]:
print(y)

[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2
 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2
 2 2]

In [234]:
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [235]:
iris.DESCR

'Iris Plants Database\n====================\n\nNotes\n-----\nData Set Characteristics:\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20  0.76     0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThis is a copy of UCI ML iris datasets.\nhttp://archive.ics.uci.edu/ml/datasets/Iris\n\nThe famous Iris database, first used by Sir R.A Fisher\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\nReferences\n----------\n   - Fisher,R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda,R.O., & Hart,P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...\n'

In [236]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [237]:
y.shape, X.shape

((150,), (150, 4))

In [238]:
ir = np.c_[y, X]

In [239]:
ir.shape

(150, 5)

In [240]:
ir[:,0]

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.])

In [241]:
x = pd.DataFrame(ir, columns=['Species']+list(iris.feature_names))

In [242]:
x.head(3)

,Species,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
0,0.0,5.1,3.5,1.4,0.2
1,0.0,4.9,3.0,1.4,0.2
2,0.0,4.7,3.2,1.3,0.2

In [243]:
x.to_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\iris.csv")

In [244]:
hyp = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 8-9 Hypothesis Testing Ex 1.csv")

In [245]:
hyp.head(3)

    ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70       0     4    1       1     1    57     52     41     47   57
1  121       1     4    2       1     3    68     59     53     63   61
2   86       0     4    3       1     1    44     33     54     58   31

In [246]:
hyp.tail(3)

      ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
197  187       1     4    2       2     1    57     41     57     55   52
198  118       1     4    2       1     1    55     62     58     58   61
199  137       1     4    3       1     2    63     65     65     53   61

In [247]:
hyp.info()#null values can be seen using the info of the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
ID        200 non-null int64
Gender    200 non-null int64
Race      200 non-null int64
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: int64(11)
memory usage: 17.3 KB

### Slicing dataframes

In [248]:
hyp.Gender = hyp.Gender.astype('category')

In [249]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
ID        200 non-null int64
Gender    200 non-null category
Race      200 non-null int64
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: category(1), int64(10)
memory usage: 16.0 KB

In [250]:
hyp.Gender

0      0
1      1
2      0
3      0
4      0
5      0
6      0
7      0
8      0
9      0
10     0
11     0
12     0
13     0
14     0
15     0
16     0
17     0
18     0
19     0
20     0
21     0
22     0
23     0
24     0
25     0
26     0
27     0
28     0
29     0
      ..
170    1
171    1
172    1
173    1
174    1
175    1
176    1
177    1
178    1
179    1
180    1
181    1
182    1
183    1
184    1
185    1
186    1
187    1
188    1
189    1
190    1
191    1
192    1
193    1
194    1
195    1
196    1
197    1
198    1
199    1
Name: Gender, Length: 200, dtype: category
Categories (2, int64): [0, 1]

In [251]:
x = hyp[['Gender']] #indicates a df

In [252]:
x.shape

(200, 1)

In [253]:
hyp['Gender'].shape #single [] indicates a series

(200,)

In [254]:
hyp.Gender.shape

(200,)

In [255]:
d = pd.DataFrame(hyp.Gender)
d.head(2)

  Gender
0      0
1      1

In [256]:
hyp.Gender.dtype

CategoricalDtype(categories=[0, 1], ordered=False)

In [257]:
type(hyp.Gender) #it's a series object but the datatype of the elements of the series object is category

pandas.core.series.Series

In [258]:
y = hyp[['Gender']]
y.shape

(200, 1)

In [259]:
type(y)

pandas.core.frame.DataFrame

In [260]:
hyp[:3]

    ID Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70      0     4    1       1     1    57     52     41     47   57
1  121      1     4    2       1     3    68     59     53     63   61
2   86      0     4    3       1     1    44     33     54     58   31

In [261]:
hyp[10:15] #to retrieve the 10th to 14th rows

     ID Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
10   75      0     4    2       1     3    60     46     51     53   61
11   60      0     4    2       1     2    57     65     51     63   61
12   95      0     4    3       1     2    73     60     71     61   71
13  104      0     4    3       1     2    54     63     57     55   46
14   38      0     3    1       1     2    45     57     50     31   56

In [262]:
#to retrieve School col, prog, read of 10th to 14th rows
hyp[10:15][["School", "Prog", "Read"]]

    School  Prog  Read
10       1     3    60
11       1     2    57
12       1     2    73
13       1     2    54
14       1     2    45

In [263]:
hyp[:15][["ID","Gender","Race", "SEB", "School", "Prog"]].head()

    ID Gender  Race  SEB  School  Prog
0   70      0     4    1       1     1
1  121      1     4    2       1     3
2   86      0     4    3       1     1
3  141      0     4    3       1     3
4  172      0     4    2       1     2

In [264]:
brics[:3]

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516       200.4
1  Russia     Moscow  17.100       143.5
2   India  New Delhi   3.286      1252.0

In [265]:
brics['COUNTRY']

0    Brazil
1    Russia
2     India
3     China
4        SA
Name: COUNTRY, dtype: object

In [266]:
brics.COUNTRY #will also return a series

0    Brazil
1    Russia
2     India
3     China
4        SA
Name: COUNTRY, dtype: object

In [267]:
brics[['COUNTRY']]

  COUNTRY
0  Brazil
1  Russia
2   India
3   China
4      SA

In [268]:
brics[['COUNTRY', 'AREA']]

  COUNTRY    AREA
0  Brazil   8.516
1  Russia  17.100
2   India   3.286
3   China   9.597
4      SA   1.221

In [269]:
brics

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516      200.40
1  Russia     Moscow  17.100      143.50
2   India  New Delhi   3.286     1252.00
3   China    Beijing   9.597     1357.00
4      SA   Pretoria   1.221       52.98

In [270]:
brics[[True, False, True, False, True]]

  COUNTRY    CAPITAL   AREA  POPULATION
0  Brazil   Brasilia  8.516      200.40
2   India  New Delhi  3.286     1252.00
4      SA   Pretoria  1.221       52.98

In [271]:
np.logical_and(brics.CAPITAL=="New Delhi", brics.AREA<10)

0    False
1    False
2     True
3    False
4    False
Name: CAPITAL, dtype: bool

In [272]:
brics[np.logical_and(brics.CAPITAL=="New Delhi", brics.AREA<10)]#retrieves the rows which satisfy cond

  COUNTRY    CAPITAL   AREA  POPULATION
2   India  New Delhi  3.286      1252.0

In [273]:
brics[~np.logical_and(brics.CAPITAL=="New Delhi", brics.AREA<10)] #to retrieve rows not satisfying the cond

  COUNTRY   CAPITAL    AREA  POPULATION
0  Brazil  Brasilia   8.516      200.40
1  Russia    Moscow  17.100      143.50
3   China   Beijing   9.597     1357.00
4      SA  Pretoria   1.221       52.98

In [274]:
brics

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516      200.40
1  Russia     Moscow  17.100      143.50
2   India  New Delhi   3.286     1252.00
3   China    Beijing   9.597     1357.00
4      SA   Pretoria   1.221       52.98

### loc function
format is: df[row_index, column_name]

In [275]:
brics.loc[:,["COUNTRY", "CAPITAL"]]

  COUNTRY    CAPITAL
0  Brazil   Brasilia
1  Russia     Moscow
2   India  New Delhi
3   China    Beijing
4      SA   Pretoria

In [276]:
brics.loc[[0,1,2], ['COUNTRY', 'AREA']]

  COUNTRY    AREA
0  Brazil   8.516
1  Russia  17.100
2   India   3.286

In [277]:
brics.set_index('COUNTRY', inplace = True)

In [278]:
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [279]:
brics.loc[['China', 'India'], ['POPULATION']]

         POPULATION
COUNTRY
China        1357.0
India        1252.0

In [280]:
brics.loc['India', ['POPULATION']] #this returns a series

POPULATION    1252
Name: India, dtype: object

In [281]:
brics.loc[["India"],['POPULATION']]

         POPULATION
COUNTRY
India        1252.0

In [282]:
brics.loc[:, 'POPULATION']

COUNTRY
Brazil     200.40
Russia     143.50
India     1252.00
China     1357.00
SA          52.98
Name: POPULATION, dtype: float64

In [283]:
brics.loc['Brazil': 'China': 2 , 'AREA':]

          AREA  POPULATION
COUNTRY
Brazil   8.516       200.4
India    3.286      1252.0

In [284]:
hyp.head(3)

    ID Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70      0     4    1       1     1    57     52     41     47   57
1  121      1     4    2       1     3    68     59     53     63   61
2   86      0     4    3       1     1    44     33     54     58   31

In [285]:
hyp.loc[5:11:2,"Gender": "Prog"]
#here it means we are looking for row names 5 to 11 so 11th row index will also be retrieved

   Gender  Race  SEB  School  Prog
5       0     4    2       1     2
7       0     1    2       1     2
9       0     3    2       1     2
11      0     4    2       1     2

In [286]:
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [287]:
brics.loc[[True, False, True, False, True], [True, False, True]]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia      200.40
India    New Delhi     1252.00
SA        Pretoria       52.98

In [288]:
brics.loc[brics.CAPITAL == "New Delhi", ['AREA']]

          AREA
COUNTRY
India    3.286

In [289]:
brics.CAPITAL

COUNTRY
Brazil     Brasilia
Russia       Moscow
India     New Delhi
China       Beijing
SA         Pretoria
Name: CAPITAL, dtype: object

In [290]:
brics.CAPITAL.isin(['Moscow', 'Beijing'])

COUNTRY
Brazil    False
Russia     True
India     False
China      True
SA        False
Name: CAPITAL, dtype: bool

In [291]:
brics.columns

Index(['CAPITAL', 'AREA', 'POPULATION'], dtype='object')

In [292]:
brics.columns.isin(["PAN", 'CAPITAL', 'AREA',"Gender", "AadharNum"])

array([ True,  True, False])

In [293]:
brics.loc[:, brics.columns.isin(["PAN", 'CAPITAL', 'AREA',"Gender", "AadharNum"])]

           CAPITAL    AREA
COUNTRY
Brazil    Brasilia   8.516
Russia      Moscow  17.100
India    New Delhi   3.286
China      Beijing   9.597
SA        Pretoria   1.221

In [294]:
brics.loc[brics.CAPITAL.isin(['Moscow', 'Beijing', "Chennai", "Bangalore"]), brics.columns.isin(['CAPITAL', 'AREA'])]

         CAPITAL    AREA
COUNTRY
Russia    Moscow  17.100
China    Beijing   9.597

In [295]:
np.logical_and(brics.AREA>2, brics.POPULATION>500) 
#and means both the conditions have to be satisfied then only true 
#if either of the conditions is not satisfied, we get a false

COUNTRY
Brazil    False
Russia    False
India      True
China      True
SA        False
Name: AREA, dtype: bool

In [296]:
np.logical_or(brics.AREA>2, brics.POPULATION>500) #either of the conditions are true, a true is retrieved
#false retrieved only if both the condtions are false

COUNTRY
Brazil     True
Russia     True
India      True
China      True
SA        False
Name: AREA, dtype: bool

In [297]:
brics[np.logical_and(brics.AREA>2, brics.POPULATION>500)]

           CAPITAL   AREA  POPULATION
COUNTRY
India    New Delhi  3.286      1252.0
China      Beijing  9.597      1357.0

In [298]:
brics.loc[np.logical_and(brics.AREA>2, brics.POPULATION>500),:] #boolean subsetting

           CAPITAL   AREA  POPULATION
COUNTRY
India    New Delhi  3.286      1252.0
China      Beijing  9.597      1357.0

In [299]:
brics.columns.isin(['CAPITAL', 'AREA'])

array([ True,  True, False])

In [300]:
bosdf.head(3)

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

In [301]:
bosdf.loc[14:10:-1,: ] #row name 10 will also be retrieved

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
14,18.2,0.63796,0.0,8.14,0.0,0.538,6.096,84.5,4.4619,4.0,307.0,21.0,380.02,10.26
13,20.4,0.62976,0.0,8.14,0.0,0.538,5.949,61.8,4.7075,4.0,307.0,21.0,396.90,8.26
12,21.7,0.09378,12.5,7.87,0.0,0.524,5.889,39.0,5.4509,5.0,311.0,15.2,390.50,15.71
11,18.9,0.11747,12.5,7.87,0.0,0.524,6.009,82.9,6.2267,5.0,311.0,15.2,396.90,13.27
10,15.0,0.22489,12.5,7.87,0.0,0.524,6.377,94.3,6.3467,5.0,311.0,15.2,392.52,20.45

In [302]:
brics.POPULATION

COUNTRY
Brazil     200.40
Russia     143.50
India     1252.00
China     1357.00
SA          52.98
Name: POPULATION, dtype: float64

In [303]:
np.logical_and(brics[['POPULATION']]<10, brics[["AREA"]]>10)

         POPULATION
COUNTRY
Brazil        False
Russia        False
India         False
China         False
SA            False

### iloc function
- specifying integer location for the rows and the columns

In [304]:
brics.iloc[1:4,:1] #specify the row numbers and the col numbers

           CAPITAL
COUNTRY
Russia      Moscow
India    New Delhi
China      Beijing

In [305]:
brics.iloc[:3, [2, 0]] #row numbers: 0,1,2

         POPULATION    CAPITAL
COUNTRY
Brazil        200.4   Brasilia
Russia        143.5     Moscow
India        1252.0  New Delhi

In [306]:
#using iloc and loc commands we can change the positions of the columns

In [307]:
brics.iloc[[1]]

        CAPITAL  AREA  POPULATION
COUNTRY
Russia   Moscow  17.1       143.5

In [308]:
brics.iloc[:, brics.columns.isin(['CAPITAL', 'a'])]

           CAPITAL
COUNTRY
Brazil    Brasilia
Russia      Moscow
India    New Delhi
China      Beijing
SA        Pretoria

In [309]:
brics.CAPITAL=='New Delhi'

COUNTRY
Brazil    False
Russia    False
India      True
China     False
SA        False
Name: CAPITAL, dtype: bool

In [310]:
brics.iloc[brics.CAPITAL=='New Delhi',:] #throws error

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [ ]:
brics.iloc[[0,1,2], [0,2]]

---

In [ ]:
### Statistical fns

In [ ]:
hyp.head(3)

In [ ]:
hyp.mean()

In [ ]:
hyp.mean(axis = 0)

In [ ]:
hyp.mean(axis=0, skipna  = True) #skip the nas and find the mean

In [ ]:
#mean, median, std, min, max, argmin, argmax

In [ ]:
hyp['Math1'].quantile(q = .99,)

In [ ]:
hyp["Math1"].var()

In [ ]:
np.where(hyp.Math1>73.01) #to get the row numbers of the trues

----

### SUMMARY FUNCTIONS

In [ ]:
hyp.info()

In [ ]:
hyp.dtypes

In [ ]:
hyp.Read=hyp['Read'].astype(np.float64)

In [ ]:
hyp.Read.dtype

In [ ]:
hyp.describe()

In [ ]:
hyp.Gender.dtype

In [ ]:
hyp.describe(include = "all")

In [ ]:
#freq distribution of a uni-variate categorical variable
pd.value_counts(hyp.Gender, dropna = False)

In [ ]:
hyp.Race.value_counts(dropna=False)

In [ ]:
hyp.Race = hyp.Race.astype('category')

In [ ]:
hyp.info()

In [ ]:
hyp.head(3)

In [ ]:
categorical = list(hyp.columns)[1:6]
categorical

In [ ]:
hyp["Gender"] = hyp['Gender'].astype("category")

In [ ]:
for col in categorical:
    hyp[col] = hyp[col].astype('category')

In [ ]:
hyp.info()

In [ ]:
np.unique(hyp.Race)

In [ ]:
hyp.Race.unique()

In [ ]:
pd.crosstab(index = hyp["Gender"], columns=hyp["Race"]) #bi-variate freq table

In [ ]:
#mean marks in Math1 according to gender and according to race

In [ ]:
hyp.pivot_table(index="Gender", columns="Race", values = "ID", aggfunc=lambda x: len(x))

In [ ]:
hyp.pivot_table(index = "Gender", columns="Race", values = "Math1", aggfunc= lambda x: np.mean(x))

In [ ]:
hyp.groupby("Gender").mean()

In [ ]:
hyp.groupby("Race").median()

In [ ]:
hyp.groupby("SEB").min()

In [ ]:
hyp.groupby(["Gender", "Race"])["Read"].mean().unstack()

In [ ]:
hyp.groupby(["Race","Gender"])["Read","Math1","Math2"].mean().unstack()

In [ ]:
hyp.info()

In [ ]:
hyp.Race=hyp.Race.astype("category")

In [ ]:
#to apply different aggregations to diff colummns
aggregation = { "Read": np.mean, 
       "Math1":[np.min, np.max, np.median],
       "Math2": np.argmin}

In [ ]:
hyp.groupby("Gender").agg(aggregation)

In [ ]:
#to apply different aggregations to diff colummns
aggregation = { "Read": {"Mean_Read": np.mean}, 
       "Math1":{"Min_Math1": np.min, "Max_Math1": np.max, "Median_Math1": np.median},
       "Math2": {"Argmin_Math1": np.argmin},
        "Race": {"Count_Race":'count'}} 
#note the quotes in count for the series functions

In [ ]:
matches = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\matches.csv")

In [ ]:
matches.shape

In [ ]:
matches.head(3)

In [ ]:
pd.value_counts(matches.toss_decision)

In [ ]:
pd.unique(matches.toss_decision)

In [ ]:
grouped = matches.groupby("toss_decision")

In [ ]:
grouped

In [ ]:
fld = grouped.get_group('field')

In [ ]:
bat = grouped.get_group('bat')

In [ ]:
bat.head(3)

In [ ]:
grouped.win_by_runs.mean()

In [ ]:
grouped.count()

In [ ]:
grouped.mean()

In [ ]:
grouped[['season', 'win_by_runs', "win_by_wickets"]].median()

In [ ]:
grouped.agg(['sum', np.mean])

In [ ]:
#different aggregation fn for diff column and the aggregation fn can also be custom defined

In [ ]:
def data_range(series):
    return series.max() - series.min()

In [ ]:
grouped.agg(data_range)

In [ ]:
aggregations = {
                'season': {'Season_Mean': np.mean},
                'win_by_runs': {'Max_winbyruns': np.max, 'Range_winbyRuns': data_range},
    'win_by_wickets': {'Min_winwickets': np.min}
               }

In [ ]:
grouped.agg(aggregations)

In [ ]:
matches.groupby(['toss_decision', 'result']).season.mean().unstack()

In [ ]:
matches.head(3)

---

### CONCATENATIONS AND DROPPING

In [ ]:
brics

In [ ]:
brics.reset_index(inplace=True)

In [ ]:
brics

In [ ]:
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [ ]:
df = pd.DataFrame(dict1)

In [ ]:
df.columns = brics.columns

In [ ]:
brics

In [ ]:
df

In [ ]:
brics.append(df)

In [ ]:
dummy = pd.concat([brics, df], axis = 0) #row wise

In [ ]:
dummy.reset_index(inplace=True)

In [ ]:
dummy.drop(["index"], axis = 1, inplace = True)

In [ ]:
pd.concat([brics, df], axis = 1) #col wise

In [ ]:
#to insert a col

In [ ]:
brics.insert(loc = 3, column="x", value = [1,2,3,10,12])

In [ ]:
brics

In [ ]:
#how to merge the dfs

In [ ]:
left = { 'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']}

right = {'id':[1,6,3,4,5],
         'Height': [120,110,115,119,130],
        }

In [ ]:
left = pd.DataFrame(left)
left

In [ ]:
right = pd.DataFrame(right)
right

In [ ]:
pd.merge(left,right, how="inner", on = "id")

In [ ]:
#to drop the rows / columns

In [ ]:
matches.head(2)

In [ ]:
matches.drop([0,1], axis = 0, inplace=True) #axis 0 to del rows and axis = 1 to del col

In [ ]:
matches.drop(['city', 'season'], axis = 1, inplace = True)

In [ ]:
matches.columns

In [ ]:
import pandasql as pdsql

In [ ]:
query = "select Read, Math1 from hyp where Read < 30 or Math1 > 60 ;"

In [ ]:
df1 = pdsql.sqldf(query)

In [ ]:
df1.head(4)

In [ ]:
#how to use string fns on the character columns of a df

In [ ]:
matches.head(2)

In [ ]:
matches.player_of_match.loc[2]

In [ ]:
matches['fname'] = matches.player_of_match.str.split().str[0]
fname[:4]

In [ ]:
matches.head(2)

In [ ]:
matches['toss_decision'] = matches.toss_decision.str.upper()

In [ ]:
matches.head(2)

In [ ]:
#to iterate over each row of the df

In [ ]:
for row in range(len(brics)):
    print(brics.iloc[row], "\n")

In [ ]:
for lab, row in brics.iterrows():
    print(lab)
    print()
    print(row)
    print("\n","\n")

In [ ]:
brics

In [ ]:
brics = brics.drop(['x'], axis = 1)

In [ ]:
brics

In [ ]:
brics['Popln_per_sqft'] = brics.POPULATION/brics.AREA

In [ ]:
brics

In [ ]:
matches.head()

In [ ]:
matches['toss_d'] = 'a'

In [ ]:
matches.toss_decision.iloc[2][0]

In [ ]:
matches.toss_decision[0]

In [ ]:
matches['toss_d'] = matches.toss_decision.str[0]
#string fns can be applied only to the string objects
#if you need to apply string function to entire char col, you need to prefix str.

In [ ]:
matches['toss_d'][:3]

In [ ]:
matches['toss_d']=matches['toss_d'].str.upper()

In [ ]:
matches["toss_dec"] = 'a'

In [ ]:
len(matches[:5])

In [ ]:
matches["toss_dec"][2]

In [ ]:
matches.reset_index(inplace = True)

In [ ]:
matches.drop(labels = "index", axis = 1, inplace = True)

In [ ]:
matches.head(3)

In [ ]:
for i in range(len(matches[:5])):
    matches["toss_dec"][i] = matches.toss_decision[i].upper()

In [ ]:
matches['toss_dec'][:10]

In [ ]:
matches[4:7]['toss_winner']

In [ ]:
matches['match_opponents'] = matches['team1']+" vs " + matches["team2"]

In [ ]:
matches.match_opponents[:4]

In [ ]:
#apply function - to apply a function on each component of the series

In [314]:
brics.reset_index(inplace=True)

In [315]:
brics

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516      200.40
1  Russia     Moscow  17.100      143.50
2   India  New Delhi   3.286     1252.00
3   China    Beijing   9.597     1357.00
4      SA   Pretoria   1.221       52.98

In [316]:
brics["length_country"] = brics.COUNTRY.apply(len)

In [317]:
brics

  COUNTRY    CAPITAL    AREA  POPULATION  length_country
0  Brazil   Brasilia   8.516      200.40               6
1  Russia     Moscow  17.100      143.50               6
2   India  New Delhi   3.286     1252.00               5
3   China    Beijing   9.597     1357.00               5
4      SA   Pretoria   1.221       52.98               2

In [320]:
brics.COUNTRY.map(len)

0    6
1    6
2    5
3    5
4    2
Name: COUNTRY, dtype: int64

In [321]:
brics.COUNTRY.map(lambda x: len(x))

0    6
1    6
2    5
3    5
4    2
Name: COUNTRY, dtype: int64

In [322]:
brics.COUNTRY.map({'Brazil': 'Br', "India": "Ind"})

0     Br
1    NaN
2    Ind
3    NaN
4    NaN
Name: COUNTRY, dtype: object

In [326]:
hyp.Gender.map({0: "M", 1: "F"})[:3] 
#so map can map a fn or a dictionary on each component of the series

0    M
1    F
2    M
Name: Gender, dtype: object

In [329]:
brics.COUNTRY.replace("Brazil", "Br") 
#so Brazil gets replaced by Br and other values are not replaced

0        Br
1    Russia
2     India
3     China
4        SA
Name: COUNTRY, dtype: object

In [337]:
brics.COUNTRY.replace(to_replace = "^B", value = "New", regex= True)

0    Newrazil
1      Russia
2       India
3       China
4          SA
Name: COUNTRY, dtype: object

In [331]:
hyp.Gender.replace({0: "Male", 1:"Female"})[:5]

0      Male
1    Female
2      Male
3      Male
4      Male
Name: Gender, dtype: object

In [268]:
s = pd.Series([20,40,60])

In [271]:
log_s = s.apply(np.log)
log_s

0    2.995732
1    3.688879
2    4.094345
dtype: float64

In [272]:
len(brics)

5

In [273]:
len("how")

3

In [274]:
len(np.array([[1,2], [3,4]]))

2

In [275]:
len([1,3,5])

3

In [339]:
def printdictionary(*args, **kwargs):
    #*args indicates as many number of arguments as you want
    #**kwargs indicates the dictionary of arguments and their values
    print(kwargs)
    for key in kwargs:
        print(key, kwargs[key])

In [340]:
printdictionary(a = 5, b = 10, c = 20, why = "Samridhi")

{'a': 5, 'b': 10, 'c': 20, 'why': 'Samridhi'}
a 5
b 10
c 20
why Samridhi

In [341]:
def add_custom_values(x, *args, **kwargs): 
    for month in kwargs:
        x+=kwargs[month]
    return x

In [342]:
add_custom_values(20, jan = 1, feb = 2)

23

In [343]:
s = pd.Series([20,21,12], index = ["London", "NewYork", "California"])
s.apply(add_custom_values, june = 0, july = 1, aug = 2, a = 12)

London        35
NewYork       36
California    27
dtype: int64

In [344]:
s.map(add_custom_values, june = 0, july = 1, aug = 2, a = 12)
#so here map fn can't be used as there are additional arguments

TypeError: map() got an unexpected keyword argument 'june'

In [289]:
#to remove duplicate rows
matches = matches.drop_duplicates()

In [294]:
#to sort the rows of a df
matches.sort_values(by = ['team1','win_by_runs'], ascending = False, inplace = True)

In [296]:
brics.to_csv(r"C:\Users\Vaibhav\Desktop\brics.csv")

---

In [297]:
data = {'raw': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}

In [299]:
df = pd.DataFrame(data)
df

                                  raw
0   Arizona 1 2014-12-23       3242.0
1      Iowa 1 2010-02-23       3453.7
2    Oregon 0 2014-06-20       2123.0
3  Maryland 0 2014-03-14       1123.6
4   Florida 1 2013-01-15       2134.0
5   Georgia 0 2012-07-14       2345.6

In [300]:
import re

In [ ]:
#to find out all the single digits

In [303]:
a = df.iloc[0][0]
a

'Arizona 1 2014-12-23       3242.0'

In [307]:
p = re.search("(\d)", a)
p.group()

'1'

In [310]:
df['female'] = df["raw"].str.extract("(\d)", expand = True)#expand = True gives df and expand = False gives series
df.female

0    1
1    1
2    0
3    0
4    1
5    0
Name: female, dtype: object

In [314]:
df["date"] = df["raw"].str.extract("(\d\d\d\d-..-..)", expand = True)
df.date

0    2014-12-23
1    2010-02-23
2    2014-06-20
3    2014-03-14
4    2013-01-15
5    2012-07-14
Name: date, dtype: object

In [317]:
df["score"]=df['raw'].str.extract("(\d\d\d\d\.\d)", expand = True)

In [323]:
df["raw"].str.extract("([A-Z]\w{1,})", expand = True)

          0
0   Arizona
1      Iowa
2    Oregon
3  Maryland
4   Florida
5   Georgia